Repository: harrysxu/MigraineNoteIOS
Catalog: migraine_note/migraine_note/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# profile.upgrade.premium
source: Upgrade to Premium
zh_hans: 升级高级版
zh_hant: 升級高級版

# profile.unlock.all.features
source: Unlock all professional features
zh_hans: 解锁全部专业功能
zh_hant: 解鎖全部專業功能

# profile.medication.box
source: Medication Box
zh_hans: 药箱管理
zh_hant: 藥箱管理

# profile.medication.total
source: Total medications
zh_hans: 药物总数
zh_hant: 藥物總數

# profile.acute.medication.this.month
source: Acute med this month
zh_hans: 本月急性用药
zh_hant: 本月急性用藥

# profile.low.inventory
source: %d medications low stock
zh_hans: %d种药物库存不足
zh_hant: %d種藥物庫存不足

# profile.tap.to.fill
source: Tap to fill profile
zh_hans: 点击填写个人信息
zh_hant: 點擊填寫個人信息

# profile.my.info
source: My Profile
zh_hans: 我的信息
zh_hant: 我的信息

# profile.restore.initial
source: Restore to initial state
zh_hans: 恢复到初始状态
zh_hant: 恢復到初始狀態

# settings.data.privacy
source: Data & Privacy
zh_hans: 数据与隐私
zh_hant: 數據與隱私

# settings.icloud.sync
source: iCloud Sync
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# settings.data.export
source: Data Export
zh_hans: 数据导出
zh_hant: 數據導出

# settings.features
source: Features
zh_hans: 功能设置
zh_hant: 功能設置

# settings.label.management
source: Label Management
zh_hans: 标签管理
zh_hant: 標籤管理

# settings.personalization
source: Personalization
zh_hans: 个性化配置
zh_hant: 個性化配置

# settings.about.app
source: About
zh_hans: 关于应用
zh_hant: 關於應用

# settings.appearance
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# settings.location.subtitle
source: Track weather triggers
zh_hans: 追踪天气诱因
zh_hant: 追蹤天氣誘因

# settings.icloud.subtitle
source: Multi-device sync
zh_hans: 多设备协同
zh_hant: 多設備協同

# settings.data.privacy.footer
source: All data is stored in your iCloud private database. Only you can access it.
zh_hans: 所有数据存储在您的iCloud私有数据库，仅您本人可访问。
zh_hant: 所有數據存儲在您的iCloud私有數據庫，僅您本人可訪問。

# settings.label.subtitle
source: Custom symptoms, triggers, medications
zh_hans: 自定义症状、诱因、药物标签
zh_hant: 自定義症狀、誘因、藥物標籤

# settings.personalization.subtitle
source: Customize your experience
zh_hans: 定制专属体验
zh_hant: 定製專屬體驗

# settings.about.subtitle
source: Version & help
zh_hans: 版本与帮助
zh_hant: 版本與幫助

# onboarding.skip
source: Skip
zh_hans: 跳过
zh_hant: 跳過

# onboarding.welcome
source: Welcome to Migraine Manager
zh_hans: 欢迎使用头痛管家
zh_hant: 歡迎使用頭痛管家

# onboarding.feature.record
source: Record each attack, discover health patterns
zh_hans: 记录每次发作，发现健康规律
zh_hant: 記錄每次發作，發現健康規律

# onboarding.feature.communicate
source: Better communicate symptoms with doctors
zh_hans: 与医生更好地沟通你的症状
zh_hant: 與醫生更好地溝通你的症狀

# onboarding.feature.manage
source: Scientific management, improve quality of life
zh_hans: 科学管理，改善生活质量
zh_hant: 科學管理，改善生活質量

# onboarding.privacy.title
source: Your data, fully private
zh_hans: 您的数据，完全私密
zh_hant: 您的數據，完全私密

# onboarding.privacy.local
source: Stored only on your device
zh_hans: 仅存储在您的设备
zh_hant: 僅存儲在您的設備

# onboarding.privacy.icloud
source: Auto sync via iCloud
zh_hans: 通过iCloud自动同步
zh_hant: 通過iCloud自動同步

# onboarding.privacy.no.access
source: We cannot access your data
zh_hans: 我们无法访问您的数据
zh_hant: 我們無法訪問您的數據

# onboarding.permissions.optional
source: Required permissions (optional)
zh_hans: 需要的权限（可选）
zh_hant: 需要的權限（可選）

# onboarding.location.reason
source: Location - record weather triggers
zh_hans: 位置服务 - 记录天气诱因
zh_hant: 位置服務 - 記錄天氣誘因

# onboarding.ready.title
source: All set!
zh_hans: 一切准备就绪
zh_hant: 一切準備就緒

# onboarding.ready.question
source: Ready for your first record?
zh_hans: 要现在开始第一次记录吗？
zh_hant: 要現在開始第一次記錄嗎？

# onboarding.quick.start
source: Quick Start
zh_hans: 快速开始
zh_hant: 快速開始

# onboarding.quick.start.hint
source: Tap the "Record" button on home to start your first record
zh_hans: 点击首页的"轻触记录"按钮 即可开始您的第一次记录
zh_hant: 點擊首頁的"輕觸記錄"按鈕 即可開始您的第一次記錄

# onboarding.start
source: Get Started
zh_hans: 开始使用
zh_hant: 開始使用

# common.error
source: Error
zh_hans: 错误
zh_hant: 錯誤

# label.badge.default
source: Default
zh_hans: 默认
zh_hant: 預設

# label.badge.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# label.category.intervention
source: Non-drug interventions
zh_hans: 非药物干预
zh_hant: 非藥物干預

# label.category.painQuality
source: Pain quality
zh_hans: 疼痛性质
zh_hant: 疼痛性質

# label.category.aura
source: Aura types
zh_hans: 先兆类型
zh_hant: 先兆類型

# label.category.trigger
source: Trigger
zh_hans: 诱因
zh_hant: 誘因

# label.category.symptom
source: Symptom
zh_hans: 症状
zh_hant: 症狀

# label.symptomSubcategory.western
source: Western symptoms
zh_hans: 西医症状
zh_hant: 西醫症狀

# label.symptomSubcategory.tcm
source: TCM symptoms
zh_hans: 中医症状
zh_hant: 中醫症狀

# editor.label.countFormat
source: %d items
zh_hans: %d 个
zh_hant: %d 個

# editor.footer.dragHint
source: Long press to reorder. Default labels can be hidden but not deleted
zh_hans: 长按拖动可调整顺序，默认标签只能隐藏不能删除
zh_hant: 長按拖動可調整順序，預設標籤只能隱藏不能刪除

# editor.intervention.addButton
source: Add custom intervention
zh_hans: 添加自定义干预方式
zh_hant: 添加自訂干預方式

# editor.painQuality.addButton
source: Add custom pain quality
zh_hans: 添加自定义疼痛性质
zh_hant: 添加自訂疼痛性質

# editor.aura.addButton
source: Add custom aura type
zh_hans: 添加自定义先兆类型
zh_hant: 添加自訂先兆類型

# editor.action.rename
source: Rename
zh_hans: 重命名
zh_hant: 重新命名

# editor.action.delete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# editor.rename.title
source: Rename label
zh_hans: 重命名标签
zh_hant: 重新命名標籤

# editor.rename.placeholder
source: New name
zh_hans: 新名称
zh_hant: 新名稱

# validation.rename.maxChars
source: Enter new name (max 10 characters)
zh_hans: 请输入新的标签名称(最多10个字符)
zh_hant: 請輸入新的標籤名稱(最多10個字元)

# validation.rename.generic
source: Enter new label name
zh_hans: 请输入新的标签名称
zh_hant: 請輸入新的標籤名稱

# editor.trigger.title
source: Trigger label management
zh_hans: 诱因标签管理
zh_hant: 誘因標籤管理

# editor.trigger.description
source: Manage trigger labels by category. Default labels can be hidden but not deleted.
zh_hans: 按分类管理诱因标签，默认标签可以隐藏但不能删除。
zh_hant: 按分類管理誘因標籤，預設標籤可以隱藏但不能刪除。

# editor.medication.title
source: Medication preset management
zh_hans: 药物预设管理
zh_hant: 藥物預設管理

# editor.medication.description
source: Manage common medication presets for quick adding. Default medications can be hidden but not deleted.
zh_hans: 管理常用药物预设，方便快速添加药物。默认药物可以隐藏但不能删除。
zh_hant: 管理常用藥物預設，方便快速添加藥物。預設藥物可以隱藏但不能刪除。

# editor.symptom.title
source: Symptom label management
zh_hans: 症状标签管理
zh_hant: 症狀標籤管理

# editor.symptom.description
source: Default labels can be hidden but not deleted. Custom labels can be edited and deleted anytime.
zh_hans: 默认标签可以隐藏但不能删除，自定义标签可以随时修改和删除。
zh_hant: 預設標籤可以隱藏但不能刪除，自訂標籤可以隨時修改和刪除。

# section.labelInfo
source: Label info
zh_hans: 标签信息
zh_hant: 標籤資訊

# section.medicationInfo
source: Medication info
zh_hans: 药物信息
zh_hant: 藥物資訊

# editor.category
source: Category
zh_hans: 分类
zh_hant: 分類

# editor.type
source: Type
zh_hans: 类型
zh_hant: 類型

# editor.trigger.namePlaceholder
source: Trigger name
zh_hans: 诱因名称
zh_hant: 誘因名稱

# editor.trigger.addHint
source: After adding, this trigger will appear in the recording flow. Max %d characters.
zh_hans: 添加后，该诱因将出现在记录流程的诱因选择界面。标签长度限制为%d个字符。
zh_hant: 添加後，該誘因將出現在記錄流程的誘因選擇介面。標籤長度限制為%d個字元。

# editor.trigger.addTitle
source: Add trigger label
zh_hans: 添加诱因标签
zh_hant: 添加誘因標籤

# editor.symptom.namePlaceholder
source: Symptom name
zh_hans: 症状名称
zh_hant: 症狀名稱

# editor.symptom.addHint
source: After adding, this symptom will appear in the recording flow. Max %d characters.
zh_hans: 添加后，该症状将出现在记录流程的症状选择界面。标签长度限制为%d个字符。
zh_hant: 添加後，該症狀將出現在記錄流程的症狀選擇介面。標籤長度限制為%d個字元。

# editor.symptom.addTitle
source: Add symptom label
zh_hans: 添加症状标签
zh_hant: 添加症狀標籤

# editor.symptom.sectionWestern
source: Western symptoms
zh_hans: 西医症状
zh_hant: 西醫症狀

# editor.symptom.sectionTcm
source: TCM symptoms
zh_hans: 中医症状
zh_hant: 中醫症狀

# editor.medication.namePlaceholder
source: Medication name
zh_hans: 药物名称
zh_hant: 藥物名稱

# editor.medication.addHint
source: Add common medications to preset list for quick selection when adding.
zh_hans: 添加常用药物到预设列表，方便在添加药物时快速选择。
zh_hant: 添加常用藥物到預設列表，方便在添加藥物時快速選擇。

# editor.medication.addTitle
source: Add medication preset
zh_hans: 添加药物预设
zh_hant: 添加藥物預設

# validation.label.duplicate
source: Label name already exists
zh_hans: 标签名称已存在
zh_hant: 標籤名稱已存在

# editor.addLabel.title
source: Add custom label
zh_hans: 添加自定义标签
zh_hant: 添加自訂標籤

# editor.addLabel.namePlaceholder
source: Label name
zh_hans: 标签名称
zh_hant: 標籤名稱

# editor.addLabel.hintFormat
source: Enter label name (%d-%d characters) for quick selection
zh_hans: 输入标签名称(%d-%d个字符)，方便下次快速选择
zh_hant: 輸入標籤名稱(%d-%d個字元)，方便下次快速選擇

# editor.addLabel.addTitleFormat
source: Add custom %@
zh_hans: 添加自定义%@
zh_hant: 添加自訂%@

# validation.label.empty
source: Label name cannot be empty
zh_hans: 标签名称不能为空
zh_hant: 標籤名稱不能為空

# validation.label.minLengthFormat
source: Label name needs at least %d characters
zh_hans: 标签名称至少需要%d个字符
zh_hant: 標籤名稱至少需要%d個字元

# validation.label.maxLengthFormat
source: Label name cannot exceed %d characters
zh_hans: 标签名称不能超过%d个字符
zh_hant: 標籤名稱不能超過%d個字元

# validation.label.duplicateName
source: This label already exists
zh_hans: 该标签已存在
zh_hant: 該標籤已存在

# validation.label.tooLongFormat
source: Label name too long, max %d characters
zh_hans: 标签名称过长，最多%d个字符
zh_hant: 標籤名稱過長，最多%d個字元

# validation.label.invalid
source: Invalid label name
zh_hans: 标签名称无效
zh_hant: 標籤名稱無效

# validation.label.operationFailed
source: Operation failed
zh_hans: 操作失败
zh_hant: 操作失敗

# validation.label.addFailed
source: Failed to add, please try again
zh_hans: 添加失败，请重试
zh_hant: 添加失敗，請重試

# label.category.auraShort
source: Aura
zh_hans: 先兆
zh_hant: 先兆

# export.title
source: Data Export
zh_hans: 数据导出
zh_hant: 數據導出

# export.description
source: Export your migraine data including analytics and detailed records. CSV format suits data analysis; PDF suits printing and medical visits.
zh_hans: 导出您的偏头痛数据，包含统计分析和详细记录。CSV格式适合数据分析，PDF格式适合打印和医疗就诊。
zh_hant: 導出您的偏頭痛數據，包含統計分析和詳細記錄。CSV格式適合數據分析，PDF格式適合列印和醫療就診。

# export.timeRange
source: Time range
zh_hans: 时间范围
zh_hant: 時間範圍

# export.range.lastMonth
source: Last month
zh_hans: 近1个月
zh_hant: 近1個月

# export.range.last3Months
source: Last 3 months
zh_hans: 近3个月
zh_hant: 近3個月

# export.range.last6Months
source: Last 6 months
zh_hans: 近6个月
zh_hant: 近6個月

# export.range.lastYear
source: Last year
zh_hans: 近1年
zh_hant: 近1年

# export.range.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# export.startDate
source: Start date
zh_hans: 开始日期
zh_hant: 開始日期

# export.endDate
source: End date
zh_hans: 结束日期
zh_hant: 結束日期

# export.fileType
source: File type
zh_hans: 文件类型
zh_hant: 檔案類型

# export.preview
source: Data preview
zh_hans: 数据预览
zh_hant: 數據預覽

# export.preview.attackCount
source: Attack count
zh_hans: 发作次数
zh_hant: 發作次數

# export.preview.attackDays
source: Attack days
zh_hans: 发作天数
zh_hant: 發作天數

# export.preview.healthEvents
source: Health events
zh_hans: 健康事件
zh_hant: 健康事件

# export.preview.avgIntensity
source: Average intensity
zh_hans: 平均强度
zh_hant: 平均強度

# export.preview.medicationDays
source: Medication days
zh_hans: 用药天数
zh_hant: 用藥天數

source: Export failed
zh_hans: 导出失败
zh_hant: 導出失敗

# export.button
source: Export data
zh_hans: 导出数据
zh_hant: 導出數據

# export.generating
source: Generating...
zh_hans: 生成中...
zh_hant: 生成中...

# export.noData
source: No records in selected time range
zh_hans: 所选时间范围内无记录数据
zh_hant: 所選時間範圍內無記錄數據

# export.type.csv
source: Contains stats and detailed records, suitable for Excel analysis
zh_hans: 包含统计数据和详细记录，适合Excel分析
zh_hant: 包含統計數據和詳細記錄，適合Excel分析

# export.type.pdf
source: Professional medical report, suitable for printing and visits
zh_hans: 专业医疗报告，适合打印和就诊
zh_hant: 專業醫療報告，適合列印和就診

# export.error.fileCreation
source: File creation failed
zh_hans: 文件创建失败
zh_hant: 檔案創建失敗

# medication.detail.basicInfo
source: Basic info
zh_hans: 基本信息
zh_hant: 基本資訊

# medication.detail.category
source: Category
zh_hans: 药物类别
zh_hant: 藥物類別

# medication.detail.type
source: Type
zh_hans: 用药类型
zh_hant: 用藥類型

# medication.detail.acute
source: Acute
zh_hans: 急性用药
zh_hant: 急性用藥

# medication.detail.preventive
source: Preventive
zh_hans: 预防性用药
zh_hant: 預防性用藥

# medication.detail.standardDosage
source: Standard dosage
zh_hans: 标准剂量
zh_hant: 標準劑量

# medication.detail.monthlyLimit
source: Monthly limit
zh_hans: 月度限制
zh_hant: 月度限制

# medication.detail.usageStats
source: Usage stats
zh_hans: 使用统计
zh_hant: 使用統計

# medication.detail.monthlyUsage
source: This month
zh_hans: 本月使用
zh_hant: 本月使用

# medication.detail.totalUsage
source: Total
zh_hans: 总使用
zh_hant: 總使用

# medication.detail.mohRisk
source: MOH Risk
zh_hans: MOH 风险
zh_hant: MOH 風險

# medication.detail.mohExceeded
source: Exceeded MOH threshold, please consult your doctor
zh_hans: 已超过 MOH 阈值，请咨询医生
zh_hant: 已超過 MOH 閾值，請諮詢醫生

# medication.detail.mohApproaching
source: Approaching MOH threshold, please control frequency
zh_hans: 接近 MOH 阈值，请注意控制用药频率
zh_hant: 接近 MOH 閾值，請注意控制用藥頻率

# medication.detail.mohNormal
source: Usage frequency normal
zh_hans: 用药频率正常
zh_hant: 用藥頻率正常

# medication.detail.inventory
source: Inventory
zh_hans: 库存管理
zh_hant: 庫存管理

# medication.detail.currentStock
source: Current stock
zh_hans: 当前库存
zh_hant: 當前庫存

# medication.detail.stockOut
source: Out of stock, please replenish
zh_hans: 库存已用完，请及时补充
zh_hant: 庫存已用完，請及時補充

# medication.detail.lowStock
source: Low stock, consider replenishing
zh_hans: 库存不足，建议补充
zh_hant: 庫存不足，建議補充

# medication.detail.adjustStock
source: Adjust stock
zh_hans: 调整库存
zh_hant: 調整庫存

# medication.detail.usageHistory
source: Usage history
zh_hans: 使用历史
zh_hant: 使用歷史

# medication.detail.usageHistoryFormat
source: Showing last 10 of %d records
zh_hans: 显示最近10条记录，共%d条
zh_hant: 顯示最近10條記錄，共%d條

# medication.detail.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# medication.detail.avgEffectiveness
source: Avg effectiveness
zh_hans: 平均疗效
zh_hant: 平均療效

# medication.usageRate
source: Usage rate
zh_hans: 使用率
zh_hant: 使用率

# medication.detail.effectiveness.excellent
source: Very effective
zh_hans: 非常有效
zh_hant: 非常有效

# medication.detail.effectiveness.good
source: Quite effective
zh_hans: 较为有效
zh_hant: 較為有效

# medication.detail.effectiveness.moderate
source: Moderate
zh_hans: 一般
zh_hant: 一般

# medication.detail.effectiveness.poor
source: Poor
zh_hans: 效果不佳
zh_hant: 效果不佳

# medication.detail.deleteConfirm
source: Delete medication
zh_hans: 删除药物
zh_hant: 刪除藥物

# medication.detail.deleteMessage
source: Are you sure? Related medication logs will not be deleted.
zh_hans: 确定要删除这个药物吗？相关的用药记录不会被删除。
zh_hant: 確定要刪除這個藥物嗎？相關的用藥記錄不會被刪除。

# medication.detail.editComing
source: Edit feature coming soon
zh_hans: 编辑功能即将推出
zh_hant: 編輯功能即將推出

# medication.inventory.newStock
source: New stock
zh_hans: 新库存
zh_hant: 新庫存

# medication.inventory.change
source: Change
zh_hans: 变化
zh_hant: 變化

# weather.edit.title
source: Edit weather
zh_hans: 编辑天气
zh_hant: 編輯天氣

# weather.windSpeed
source: Wind speed
zh_hans: 风速
zh_hant: 風速

source: Weather params
zh_hans: 气象参数
zh_hant: 氣象參數

# weather.pressure.trend
source: Pressure trend
zh_hans: 气压趋势
zh_hant: 氣壓趨勢

# weather.other
source: Other info
zh_hans: 其他信息
zh_hant: 其他資訊

# weather.manualEditHint
source: Manual edits will not auto-update weather data on save
zh_hans: 手动编辑后，保存时不会自动更新天气数据
zh_hant: 手動編輯後，儲存時不會自動更新天氣數據

# weather.condition.sunny
source: Sunny
zh_hans: 晴天
zh_hant: 晴天

# weather.condition.cloudy
source: Cloudy
zh_hans: 多云
zh_hant: 多雲

# weather.condition.overcast
source: Overcast
zh_hans: 阴天
zh_hant: 陰天

# weather.condition.lightRain
source: Light rain
zh_hans: 小雨
zh_hant: 小雨

# weather.condition.moderateRain
source: Moderate rain
zh_hans: 中雨
zh_hant: 中雨

# weather.condition.heavyRain
source: Heavy rain
zh_hans: 大雨
zh_hant: 大雨

# weather.condition.thunderstorm
source: Thunderstorm
zh_hans: 雷阵雨
zh_hant: 雷陣雨

# weather.condition.snow
source: Snow
zh_hans: 雪
zh_hant: 雪

# weather.condition.fog
source: Fog
zh_hans: 雾
zh_hant: 霧

# weather.condition.haze
source: Haze
zh_hans: 霾
zh_hant: 霾

# weather.condition.dustStorm
source: Dust storm
zh_hans: 沙尘暴
zh_hant: 沙塵暴

# premium.upgradeTitle
source: Upgrade to unlock more
zh_hans: 升级高级版，解锁更多功能
zh_hant: 升級高級版，解鎖更多功能

# premium.upgradeButton
source: Upgrade
zh_hans: 升级高级版
zh_hant: 升級高級版

# premium.priceHint
source: From ¥3/month
zh_hans: 低至 ¥3/月
zh_hant: 低至 ¥3/月

# premium.status.premium
source: Premium
zh_hans: 高级版
zh_hant: 高級版

# premium.status.free
source: Free
zh_hans: 免费版
zh_hant: 免費版

# premium.testMode
source: Test mode
zh_hans: 测试模式
zh_hant: 測試模式

# analytics.title
source: Analytics
zh_hans: 数据分析
zh_hant: 數據分析

# premium.feature.advancedAnalytics
source: Advanced analytics
zh_hans: 高级数据分析
zh_hant: 高級數據分析

# premium.feature.dataExport
source: Data export
zh_hans: 数据导出
zh_hant: 數據導出

# premium.feature.medicalReport
source: Medical report
zh_hans: 医疗报告
zh_hant: 醫療報告

# premium.feature.icloudSync
source: iCloud sync
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# premium.feature.menstrualAnalysis
source: Menstrual analysis
zh_hans: 经期关联分析
zh_hant: 經期關聯分析

# premium.feature.customLabels
source: Custom labels
zh_hans: 自定义标签
zh_hant: 自訂標籤

# premium.feature.medicationReminder
source: Medication reminder
zh_hans: 用药提醒
zh_hant: 用藥提醒

# premium.feature.weatherTracking
source: Weather tracking
zh_hans: 天气追踪
zh_hant: 天氣追蹤

# premium.feature.advancedAnalytics.desc
source: Monthly trends, circadian patterns, trigger analysis and more
zh_hans: 月趋势、昼夜节律、诱因分析等专业图表
zh_hant: 月趨勢、晝夜節律、誘因分析等專業圖表

# premium.feature.dataExport.desc
source: CSV/PDF export for medical visits
zh_hans: CSV/PDF 数据导出，方便就诊使用
zh_hant: CSV/PDF 數據導出，方便就診使用

# premium.feature.medicalReport.desc
source: Professional A4 medical report PDF
zh_hans: 生成专业 A4 医疗报告 PDF
zh_hant: 生成專業 A4 醫療報告 PDF

# premium.feature.icloudSync.desc
source: Auto sync across devices
zh_hans: 多设备自动同步数据
zh_hant: 多設備自動同步數據

# premium.feature.menstrualAnalysis.desc
source: Period correlation analysis from Health
zh_hans: 从 Apple 健康读取经期数据进行关联分析
zh_hant: 從 Apple 健康讀取經期數據進行關聯分析

# premium.feature.customLabels.desc
source: Custom symptoms, triggers, pain quality
zh_hans: 自定义症状、诱因、疼痛性质标签
zh_hant: 自訂症狀、誘因、疼痛性質標籤

# premium.feature.medicationReminder.desc
source: Timed medication reminders
zh_hans: 定时推送用药提醒通知
zh_hant: 定時推送用藥提醒通知

# premium.feature.weatherTracking.desc
source: Auto record weather at attack time
zh_hans: 自动记录发作时的天气状况
zh_hant: 自動記錄發作時的天氣狀況

# premium.purchase.monthly
source: Monthly
zh_hans: 月度订阅
zh_hant: 月度訂閱

# premium.purchase.yearly
source: Yearly
zh_hans: 年度订阅
zh_hant: 年度訂閱

# premium.purchase.lifetime
source: Lifetime
zh_hans: 终身买断
zh_hant: 終身買斷

# premium.purchase.monthly.subtitle
source: Cancel anytime
zh_hans: 按月付费，随时取消
zh_hant: 按月付費，隨時取消

# premium.purchase.yearly.subtitle
source: Best value, save 67%
zh_hans: 年付更划算，节省67%
zh_hant: 年付更划算，節省67%

# premium.purchase.lifetime.subtitle
source: One-time payment, use forever
zh_hans: 一次付费，永久使用
zh_hant: 一次付費，永久使用

# premium.bestValue
source: Best value
zh_hans: 最划算
zh_hant: 最划算

# premium.upgradeHeader
source: Upgrade to Premium
zh_hans: 升级高级版
zh_hant: 升級高級版

# premium.upgradeSubtitle
source: Unlock all pro features for better migraine management
zh_hans: 解锁全部专业功能，让偏头痛管理更高效
zh_hant: 解鎖全部專業功能，讓偏頭痛管理更高效

# premium.selectPlan
source: Select plan
zh_hans: 选择方案
zh_hant: 選擇方案

# premium.purchaseSuccess
source: Purchase successful
zh_hans: 购买成功
zh_hant: 購買成功

# premium.purchaseSuccessMessage
source: Congratulations! You've upgraded to Premium. All features unlocked.
zh_hans: 恭喜！您已成功升级为高级版，所有功能已解锁。
zh_hant: 恭喜！您已成功升級為高級版，所有功能已解鎖。

# premium.restore
source: Restore purchase
zh_hans: 恢复购买
zh_hant: 恢復購買

# premium.restoreComplete
source: Restore complete
zh_hans: 恢复购买完成
zh_hant: 恢復購買完成

# premium.subscribeMonth
source: Subscribe at %@/month
zh_hans: 以 %@/月 订阅
zh_hant: 以 %@/月 訂閱

# premium.subscribeYear
source: Subscribe at %@/year
zh_hans: 以 %@/年 订阅
zh_hant: 以 %@/年 訂閱

# premium.buyLifetime
source: Buy at %@
zh_hans: 以 %@ 买断
zh_hant: 以 %@ 買斷

# premium.processing
source: Processing...
zh_hans: 处理中...
zh_hant: 處理中...

# premium.termsHint
source: Subscription will auto-renew unless turned off at least 24 hours before the end of the current period.
zh_hans: 订阅将自动续订，除非在当前订阅期结束前至少24小时关闭自动续订。
zh_hant: 訂閱將自動續訂，除非在當前訂閱期結束前至少24小時關閉自動續訂。

# premium.termsHint2
source: Renewal will be charged to your Apple ID within 24 hours before the end of the current period.
zh_hans: 续订费用将在当前订阅期结束前24小时内从您的 Apple ID 账户中扣取。
zh_hant: 續訂費用將在當前訂閱期結束前24小時內從您的 Apple ID 帳戶中扣取。

# premium.termsOfUse
source: Terms of Use
zh_hans: 使用条款
zh_hant: 使用條款

# premium.privacyPolicy
source: Privacy Policy
zh_hans: 隐私政策
zh_hant: 隱私政策

# common.continue
source: Continue
zh_hans: 继续
zh_hant: 繼續

# profile.edit.title
source: My profile
zh_hans: 我的信息
zh_hant: 我的資訊

source: Profile completion
zh_hans: 档案完整度
zh_hant: 檔案完整度

# profile.basicInfo
source: Basic info
zh_hans: 基本信息
zh_hant: 基本資訊

# profile.name
source: Name
zh_hans: 姓名
zh_hant: 姓名

# profile.namePlaceholder
source: Enter name
zh_hans: 请输入姓名
zh_hant: 請輸入姓名

# profile.birthDate
source: Birth date
zh_hans: 出生日期
zh_hant: 出生日期

# profile.setBirthDate
source: Tap to set
zh_hans: 点击设置
zh_hant: 點擊設置

# profile.gender
source: Gender
zh_hans: 性别
zh_hant: 性別

# profile.bloodType
source: Blood type
zh_hans: 血型
zh_hant: 血型

# profile.notSet
source: Not set
zh_hans: 未设置
zh_hant: 未設置

# profile.bodyInfo
source: Body info
zh_hans: 身体信息
zh_hant: 身體資訊

# profile.height
source: Height
zh_hans: 身高
zh_hant: 身高

# profile.weight
source: Weight
zh_hans: 体重
zh_hant: 體重

# profile.enterPlaceholder
source: Enter
zh_hans: 请输入
zh_hant: 請輸入

# profile.medicalHistory
source: Medical history
zh_hans: 病史信息
zh_hant: 病史資訊

# profile.onsetAge
source: Onset age
zh_hans: 首发年龄
zh_hant: 首發年齡

# profile.diagnosisType
source: Diagnosis type
zh_hans: 诊断类型
zh_hant: 診斷類型

# profile.familyHistory
source: Family migraine history
zh_hans: 家族偏头痛史
zh_hant: 家族偏頭痛史

# profile.otherInfo
source: Other info
zh_hans: 其他信息
zh_hant: 其他資訊

# profile.allergies
source: Drug allergies
zh_hans: 药物过敏史
zh_hant: 藥物過敏史

# profile.allergiesPlaceholder
source: e.g. Penicillin, sulfa drugs
zh_hans: 如：青霉素、磺胺类药物等
zh_hant: 如：青黴素、磺胺類藥物等

# profile.medicalNotes
source: Medical notes
zh_hans: 医疗备注
zh_hant: 醫療備註

# profile.medicalNotesPlaceholder
source: Other medical info to record
zh_hans: 其他需要记录的医疗信息
zh_hant: 其他需要記錄的醫療資訊

# profile.bmi.underweight
source: Underweight
zh_hans: 偏瘦
zh_hant: 偏瘦

# profile.bmi.normal
source: Normal
zh_hans: 正常
zh_hant: 正常

# profile.bmi.overweight
source: Overweight
zh_hans: 偏胖
zh_hant: 偏胖

# profile.bmi.obese
source: Obese
zh_hans: 肥胖
zh_hant: 肥胖

# health.event.detail
source: Event details
zh_hans: 事件详情
zh_hant: 事件詳情

# health.event.medicationInfo
source: Medication info
zh_hans: 用药信息
zh_hant: 用藥資訊

# health.event.treatmentInfo
source: Treatment info
zh_hans: 治疗信息
zh_hant: 治療資訊

# health.event.surgeryInfo
source: Surgery info
zh_hans: 手术信息
zh_hant: 手術資訊

# health.event.noMedication
source: No medication info
zh_hans: 暂无用药信息
zh_hant: 暫無用藥資訊

# health.event.medicationN
source: Medication %d
zh_hans: 药物 %d
zh_hant: 藥物 %d

# health.event.medicationName
source: Name
zh_hans: 药物名称
zh_hant: 藥物名稱

# health.event.dosage
source: Dosage
zh_hans: 剂量
zh_hant: 劑量

# health.event.timeTaken
source: Time taken
zh_hans: 服用时间
zh_hant: 服用時間

# health.event.category
source: Category
zh_hans: 药物分类
zh_hant: 藥物分類

# health.event.treatmentType
source: Treatment type
zh_hans: 治疗类型
zh_hant: 治療類型

# health.event.duration
source: Duration
zh_hans: 治疗时长
zh_hant: 治療時長

# health.event.surgeryName
source: Surgery name
zh_hans: 手术名称
zh_hant: 手術名稱

# health.event.hospital
source: Hospital
zh_hans: 医院
zh_hant: 醫院

# health.event.doctor
source: Doctor
zh_hans: 医生
zh_hant: 醫生

# health.event.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# health.event.done
source: Done
zh_hans: 完成
zh_hant: 完成

# reminder.title
source: Medication reminder
zh_hans: 用药提醒
zh_hant: 用藥提醒

# reminder.noPermission
source: Notifications disabled
zh_hans: 通知权限未开启
zh_hant: 通知權限未開啟

# reminder.noPermissionHint
source: Enable notifications in Settings to receive reminders
zh_hans: 请在系统设置中允许通知，以接收用药提醒
zh_hant: 請在系統設置中允許通知，以接收用藥提醒

# reminder.goSettings
source: Open Settings
zh_hans: 去设置
zh_hant: 去設置
